app/controllers/animals_controller.rb

INSERT INTO "animals" ("name", "specie", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "larry"], ["specie", "tiger"], ["category_id", 2], ["created_at", 2017-03-10 07:56:05 UTC], ["updated_at", 2017-03-10 07:56:05 UTC]]
---
	def create
		find_category
		@animal = Animal.new(animal_params)
		if @animal.save

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def edit
		find_category
		@animal = Animal.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "animals" SET "name" = $1, "specie" = $2, "updated_at" = $3 WHERE "animals"."id" = $4  [["name", "asdf"], ["specie", "dsfdf"], ["updated_at", 2017-03-10 08:36:50 UTC], ["id", 3]]
---
	def update
		p "******************"
		p params
		p "*****************"
		p update_animal_params
		p "******************"
		@category = Category.find(params[:category_id])
		@animal = Animal.find(params[:id])
		if @animal.save

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 6]]
---
	def destroy
		find_category
		@animal=Animal.find(params[:id])
		@animal.delete

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
	def find_category
		@category = Category.find(params[:category_id])