app/controllers/categories_controller.rb

	def destroy
		@category = Category.find(params[:id])
		@category.delete
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 4]]